## :x: terraform/aws/tfaction:  tfmigrate plan

[Build link](https://github.com/boxp/arch/actions/runs/8222271667)

```
$ tfmigrate plan --out tfplan.binary
```

<details>


```
time="2024-03-10T13:14:49Z" level=info msg="download and unarchive the package" aqua_version=2.23.2 env=linux/amd64 exe_name=tfmigrate package_name=minamijoyo/tfmigrate package_version=v0.3.18 program=aqua registry=standard
2024/03/10 13:14:49 [INFO] [runner] unapplied migration files: [20240310115715_import_tfaction.hcl 20240310131123_import_tfaction_2.hcl]
2024/03/10 13:14:49 [INFO] [runner] load migration file: tfmigrate/20240310115715_import_tfaction.hcl
2024/03/10 13:14:49 [INFO] [migrator] start state migrator plan
2024/03/10 13:14:49 [INFO] [migrator@.] terraform version: 1.6.2
2024/03/10 13:14:50 [INFO] [migrator@.] initialize work dir
2024/03/10 13:14:50 [INFO] [migrator@.] get the current remote state
2024/03/10 13:14:51 [INFO] [migrator@.] override backend to local
2024/03/10 13:14:51 [INFO] [executor@.] create an override file
2024/03/10 13:14:51 [INFO] [migrator@.] creating local workspace folder in: terraform.tfstate.d/default
2024/03/10 13:14:51 [INFO] [executor@.] switch backend to local
2024/03/10 13:14:52 [INFO] [migrator@.] compute a new state
2024/03/10 13:15:01 [INFO] [migrator@.] check diffs
2024/03/10 13:15:04 [INFO] [migrator@.] unexpected diffs, ignoring as force option is true: failed to run command (exited 2): terraform plan -state=/tmp/tmp835742901 -input=false -no-color -detailed-exitcode -out=tfplan.binary
stdout:
module.aws.data.aws_caller_identity.current: Reading...
module.aws.data.aws_iam_policy_document.put_terraform_state: Reading...
module.aws.data.aws_iam_policy_document.read_tfmigrate_history: Reading...
module.aws.data.aws_iam_policy_document.put_tfmigrate_history: Reading...
module.aws.data.aws_iam_policy_document.read_terraform_state: Reading...
module.aws.data.aws_iam_policy_document.read_tfmigrate_history: Read complete after 0s [id=1885407253]
module.aws.data.aws_iam_policy_document.read_terraform_state: Read complete after 0s [id=1885407253]
module.aws.data.aws_iam_policy_document.put_tfmigrate_history: Read complete after 0s [id=54634239]
module.aws.data.aws_iam_policy_document.put_terraform_state: Read complete after 0s [id=54634239]
module.aws.data.aws_caller_identity.current: Read complete after 0s [id=839695154978]
module.aws.data.aws_iam_policy_document.assume_role_policy_pr: Reading...
module.aws.data.aws_iam_policy_document.assume_role_policy_main: Reading...
module.aws.data.aws_iam_policy_document.assume_role_policy_pr: Read complete after 0s [id=1724748303]
module.aws.data.aws_iam_policy_document.assume_role_policy_main: Read complete after 0s [id=3859806597]
aws_iam_role_policy_attachment.terraform_apply_admin: Refreshing state... [id=GitHubActions_Terraform_AWS_terraform_apply-arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.terraform_plan_readonly: Refreshing state... [id=GitHubActions_Terraform_AWS_terraform_plan-arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.tfmigrate_plan_readonly: Refreshing state... [id=GitHubActions_Terraform_AWS_tfmigrate_plan-arn:aws:iam::aws:policy/ReadOnlyAccess]
aws_iam_role_policy_attachment.tfmigrate_apply_readonly: Refreshing state... [id=GitHubActions_Terraform_AWS_tfmigrate_apply-arn:aws:iam::aws:policy/ReadOnlyAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws.aws_iam_policy.put_tfmigrate_history will be created
  + resource "aws_iam_policy" "put_tfmigrate_history" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "GitHubActions_Terraform_AWS_write_tfmigrate_history"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:PutObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.aws.aws_iam_policy.read_tfmigrate_history will be created
  + resource "aws_iam_policy" "read_tfmigrate_history" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "GitHubActions_Terraform_AWS_read_tfmigrate_history"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::/*"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.aws.aws_iam_role.terraform_apply will be created
  + resource "aws_iam_role" "terraform_apply" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_terraform_apply"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.terraform_plan will be created
  + resource "aws_iam_role" "terraform_plan" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_terraform_plan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.tfmigrate_apply will be created
  + resource "aws_iam_role" "tfmigrate_apply" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_tfmigrate_apply"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role.tfmigrate_plan will be created
  + resource "aws_iam_role" "tfmigrate_plan" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:boxp/arch:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::839695154978:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GitHubActions_Terraform_AWS_tfmigrate_plan"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_put_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_apply_put_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_apply_read_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_apply_read_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_apply"
    }

  # module.aws.aws_iam_role_policy_attachment.tfmigrate_plan_read_tfmigrate_history will be created
  + resource "aws_iam_role_policy_attachment" "tfmigrate_plan_read_tfmigrate_history" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GitHubActions_Terraform_AWS_tfmigrate_plan"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

stderr:
2024/03/10 13:15:04 [INFO] [executor@.] remove the override file
2024/03/10 13:15:04 [INFO] [executor@.] remove the workspace state folder
2024/03/10 13:15:04 [INFO] [executor@.] switch back to remote
2024/03/10 13:15:04 [INFO] [migrator] state migrator plan success!
2024/03/10 13:15:04 [INFO] [runner] load migration file: tfmigrate/20240310131123_import_tfaction_2.hcl
2024/03/10 13:15:04 [INFO] [migrator] start state migrator plan
2024/03/10 13:15:04 [INFO] [migrator@.] terraform version: 1.6.2
2024/03/10 13:15:05 [INFO] [migrator@.] initialize work dir
failed to run command (exited 1): terraform init -input=false -no-color
stdout:

Initializing the backend...
Initializing modules...

stderr:

Error: Backend configuration changed

A change in the backend configuration has been detected, which may require
migrating existing state.

If you wish to attempt automatic migration of the state, use "terraform init
-migrate-state".
If you wish to store the current configuration with no changes to the state,
use "terraform init -reconfigure".



```


</details>

<!-- github-comment: {"JobName":"plan","SHA1":"a52c9a72ca12a2e3941b5cecdd45c02a04eed4fc","TemplateKey":"tfmigrate-plan","Vars":{},"WorkflowName":"pull_request_target"} -->